#############################################################
#       
#      
#            ___  _ __ ___   __ _ _ __
#           / _ \| '_ ` _ \ / _` | '__|
#          | (_) | | | | | | (_| | |
#           \___/|_| |_| |_|\__,_|_|
#    _          _
#              | |__   ___| |_ __
#              | '_ \ / _ \ | '_ \ 
#              | | | |  __/ | |_) |
#              |_| |_|\___|_| .__/
#                        |_|
#############################################################
#Connect via WhatsApp.\\\\\\👉👉👉👉👉👉》https://chat.whatsapp.com/GVUPFI3cNBVKmmtJVG6ea3
#                     //////👉👉👉👉👉👉》https://www.youtube.com/channel/UC7UHYAjHf-gASPWSHw6sq3A?view_as=subscriber
##
#
#
#
#👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇
#   السلام عليكم ورحمه الله وبركاته هذه 
#
#  هذه الاداه من تصميم وبرمجه عمر القرصان
#
#   وانا من فلسطين وهذه الاداه مهديه الى اخي ليث يقيم في سوريا وان شاء الله سيكون كل يوم عليها تطور جديد وادي اخر تحديث ل 2020 وان شاء الله سيكون تحديث 2021 ان شاء الله سيكون تحديث للاداه اي استفسار او اي مشكله بالاداه فيك تخش على جروبنا انا الواتساب او تكتب على الفيسبوك عمر قرصان تلاقي عليها الجمجمه لونها زرقاء والسلام عليكم ورحمه الله وبركاته الختم عقول هذه الاداه ماديه لاخي ليث وشكرا لمن حمل الاداه ومن قرا السناريو وشكرا كثير كثير يكون السيناريو بالعربيه هو بالانجليزيه
#
#    👇👇👇👇👇👇👇👇👇👇👇👇👇👇
#
#  عيدان هذه الاداه افحص لك المواقع وتجيب لك اي بي اي موقع وايضا تتكون اداه اخرى لجوز اعطاك فاذا فيها المشاكل الي داتين تواصلوا معنا  
#
#
#
#
#
#
#
#
#      ان شاء الله الاحد تاني حتكون جوزتك على مواقع
#
#    هي تهكر اي موقع او تشل حركه اي موقع ويتعمر الجزء 2 مع الختام هذه الاداه مطوله لاخي ليث ان شاء الله تنال اعجابك يا اخي ليث والسلام عليكم ورحمه الله وبركاته
####################################
#Peace, mercy and blessings of God be upon you

 # This tool was designed and programmed by Omar Pirate
#
  #    I am from Palestine, and this tool is given to my brother Laith who lives in Syria and, God willing, every day will have a new development and the latest update for 2020 and God willing, the 2021 update will be, God willing, it will be an update of the tool. Any inquiry or any problem with the tool in you are afraid of our group. I am WhatsApp  Or write on Facebook Omar a pirate. The skull is blue. Peace be upon you, may God’s mercy and blessings be upon you. Seal The minds of this tool are material to my brother Laith.
#
 #👇👇👇👇👇👇👇👇👇👇👇👇👇👇

# Adan, this tool, check the sites for you, and answer you, the IPI site, and also another tool is formed.








#      God willing, Sunday, again, you will be your wife on sites

#     It hacks any site or paralyzes the movement of any site and builds up Part 2 with the conclusion. This tool is lengthy for my brother Laith, God willing, you will be admired, my brother Laith.
#
#
#
#
#
###############################################################
import os,sys,time,socket                                              
import random
from datetime import datetime
a = datetime.now().strftime('%Y-%m-%d %H:%M')
os.system('git pull')
os.system('clear')
def omar ():
    print ("""'\033[1;37m,,,;;;,,''...
      ...';:loxkOOkdl:,.
                  ..,cdkK0xl,.
                          ':o0O
..',;;:ccccccllloooddxxxkkOOOlx
....                   ..,;:c:o.
               .,:lddxdolc:;;,.l
        .':::c:,..             .k:.           ...
   .,:::,.                      ,XNXOkkkxdl:'.   ..'.
::;'                          ,dKXOdlc::ccox0XKkd,...,,.
                            ,0NKc.            .:d0XXx:o::.
                           ;XNd                    'cxKXdd:
                          .XNd   d,,,,,,,,,,,,,,,,,;;  ONNKo
                          lNK    k [👇👇👇👇👇👇👇]...c   ;d0Xk.
                          kNk    x.[>L A H T S H <].c      .c0Oc
                          xNK.   d [👆👆👆👆👆👆👆] .c        \033[1;31m .  .....\033[1;37m
                          'XNO   o'' '''''''''''''';:             \033[1;31m ......\033[1;37m
                           ;XN0, .. ........ .......              \033[1;31m   .',;,.\033[1;37m
                            .dXNOc.                              \033[1;31m     '...,;.\033[1;37m
  ....                        .cxKNXK0kkxxxddoolc:,..          \033[1;31m          .;'''\033[1;37m
.......                       ... ..,;::::ccclodk0XNNX0ko:.        \033[1;31m      ',. .\033[1;37m
'''''.,.                  .....                    .cxOd;;lxxl'    \033[1;31m     ......\033[1;37m
',..........      ...............                      ,do.  .:do.   \033[1;31m    .....\033[1;37m
.'...''.......  .....','',;;,,..'.      ..                :o.    ;o'       \033[1;31m .'\033[1;37m
  ..'..''''....  ....,,,,;;;;;,.','. ...'''.                cl     ,l.   \033[1;31m   ..\033[1;37m
   ......''.'......',;;,,;;;;;;;;;;,........                 .d.     c.     \033[1;31m .\033[1;37m
    ...  ....'',,,;;;;,;,;;;;;,,;;,,,;,.....    ..             o'   ..'  
            .....,;,'',,,,;;,,,,,;;;;;;,''..... ..              o'
            ............'',,''',,,;;;,,:::;;;,,,..''..           o.        
             ..  ..',''''....',,,,,;:;,;;::;;;;;;,,,.....         l   
              .   .',,'......',,,;;::::::::::::::;;,....''.       ,.
                   ...''.......',;;;;;;;::::::::::;:;,'',,'.       '
                      .........'''..''',,;;;::;::::::,'',;.          
                        ..''',,'.......',;;::::::::::,.',,,.       
        ..                ...,,'.......',;;::::ccc:::;'',,'.     
                             ',,..  ..'..;;;:cccccc::;,,,,,..""")

omar()




def jalan(z):
    for e in z + '\n':
        sys.stdout.write(e)
        sys.stdout.flush()
        time.sleep(00000.015) 

jalan("\033[1;31m================================================================================================")
print ("")
print ("")
print ("")
print ("")
jalan("\033[1;31m>>> db       .d8b.  db   db d888888b .d8888. db   db" )
jalan("\033[1;31m>>> 88      d8' `8b 88   88 `~~88~~' 88'  YP 88   88 ")
jalan("\033[1;33m>>> 88      88ooo88 88ooo88    88    `8bo.   88ooo88 ")
jalan("\033[1;33m>>> 88      88~~~88 88~~~88    88      `Y8b. 88~~~88 ")
jalan("\033[1;37m>>> 88booo. 88   88 88   88    88    db   8D 88   88 ")
jalan("\033[1;37m>>> Y88888P YP   YP YP   YP    YP    `8888Y' YP   YP ")



print ("")
#print ('')
#print ('')
print ('\033[1;32m====> Enter Your DNS Or Target: ')
hostname = input()                                           
ip=socket.gethostbyname(hostname)
print ('Host Name Is: ',hostname, '\n' 'Target Ip Is: ',ip)


#            ___  _ __ ___   __ _ _ _
#           / _ \| '_ ` _ \ / _` | '__|
#          | (_) | | | | | | (_| | |
#           \___/|_| |_| |_|\__,_|_|
#    _


#          _
             
             
             
             
     
